arduino/portentax8-stm32h7-fw/CM7/Core/Src/main.c
  if (huart2.Init.BaudRate == baud &&
      huart2.Init.WordLength == WordLength &&
      huart2.Init.StopBits == StopBits &&
      huart2.Init.Parity == Parity &&
      huart2.Init.HwFlowCtl == HwFlowCtl) {
      return;
  }

  huart2.Init.BaudRate = baud;
  huart2.Init.WordLength = WordLength;
  huart2.Init.StopBits = StopBits;
  huart2.Init.Parity = Parity;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = HwFlowCtl;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart2.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

  dbg_printf("Reconfiguring UART with %d baud, %d%c%d , %s flow control\n",
    baud, bits, parity_str, stop_bits, flow_control ? "" : "no");

  HAL_UART_DeInit(&huart2);

  if (HAL_UART_Init(&huart2) != HAL_OK) {
    Error_Handler();
  }

  UART2_enable_rx_irq();
}

/*
volatile bool can1_rx_irq = false;
volatile bool can2_rx_irq = false;

void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef *hfdcan, uint32_t RxFifo0ITs) {
  if ((RxFifo0ITs & FDCAN_IT_RX_FIFO0_NEW_MESSAGE) != RESET) {
    if (hfdcan == &hfdcan1) {
      can1_rx_irq = true;
    }
    if (hfdcan == &hfdcan2) {
      can2_rx_irq = true;
    }
  }
}
*/

uint16_t adc_sample_rate = 0;

can_t fdcan_1;
can_t fdcan_2;

void configureFDCAN(uint8_t peripheral, void* data) {

  if (peripheral == PERIPH_FDCAN1) {
    can_frequency(&fdcan_1, *((uint32_t*)data));
  } else {
    can_frequency(&fdcan_2, *((uint32_t*)data));
  }

  dbg_printf("Configuring fdcan%d with frequency %d\n", peripheral == PERIPH_FDCAN1 ? 1 : 2, *((uint32_t*)data));

  //HAL_FDCAN_ConfigFilter(&_hfdcan1, filterDef);
  //HAL_FDCAN_ConfigGlobalFilter(&_hfdcan1, nonMatchingStd, nonMatchingExt, rejectRemoteStd, rejectRemoteExt);
}

void dispatchPacket(uint8_t peripheral, uint8_t opcode, uint16_t size, uint8_t* data) {
	switch (peripheral) {
	case PERIPH_ADC: {
		if (opcode == CONFIGURE) {
			adc_sample_rate = *((uint16_t*)data);
			dbg_printf("Setting ADC samplerate to %d milliseconds\n", adc_sample_rate);
      return;
		} else {
      // opcode == channel
      get_ADC_value(opcode);
    }
		break;
	}
	case PERIPH_PWM: {
		uint8_t channel = opcode;
		struct pwmPacket config = *((struct pwmPacket*)data);
		configurePwm(channel, config.enable, config.polarity, config.duty, config.period);
		break;
	}
  case PERIPH_GPIO: {
    configureGPIO(opcode, *((uint16_t*)data));
    break;
  }
  case PERIPH_FDCAN1:
  case PERIPH_FDCAN2: {
    if (opcode == CONFIGURE) {
      configureFDCAN(peripheral, data);
      break;
    }

    if (opcode == CAN_FILTER) {
      uint32_t* info = (uint32_t*)data;
      CANFormat format = info[1] < 0x800 ? CANStandard : CANExtended;

      if (peripheral == PERIPH_FDCAN1) {
        can_filter(&fdcan_1, info[1], info[2], format, info[0]);
      }
      if (peripheral == PERIPH_FDCAN1) {
        can_filter(&fdcan_2, info[1], info[2], format, info[0]);
      }
      break;
    }

    CAN_Message msg;
    msg.type = CANData;
    msg.format = CANStandard;
    memcpy(&msg, data, size);

    dbg_printf("Sending CAN message to %x, size %d, content[0]=0x%02X\n",
      msg.id, msg.len, msg.data[0]);

    if (msg.id > 0x7FF) {
      msg.format = CANExtended;
    }

    if (peripheral == PERIPH_FDCAN1) {
      int ret = can_write(&fdcan_1, msg, 0);
      if (ret == 0) {
        can_reset(&fdcan_1);
      }
    }
    if (peripheral == PERIPH_FDCAN2) {
      int ret = can_write(&fdcan_2, msg, 0);
      if (ret == 0) {
          can_reset(&fdcan_2);
        }
    }
    break;
  }
  case PERIPH_RTC: {
    doRTCStuff(opcode, (struct rtc_time*)data);
    break;
  }
  case PERIPH_UART: {
    if (opcode == CONFIGURE) {
      struct uartPacket config = *((struct uartPacket*)data);
      configureUart(config.baud, config.bits, config.parity, config.stop_bits, config.flow_control);
    } else {
      // can only write(), read() is irq driven
      HAL_UART_Transmit(&huart2, data, size, 0xFFFFFFFF);
      //HAL_UART_Transmit_IT(&huart2, data, size);
    }
    break;
  }
  case PERIPH_H7: {
    if (opcode == FW_VERSION) {
      writeVersion();
    }
    break;
  }
	}
}

int _read(int file, char *ptr, int len) {

}

int _write(int file, char *ptr, int len) {
  HAL_UART_Transmit(&huart2, ptr, len, 100);
  return len;
}

long adc_sample_rate_last_tick = 0;
ring_buffer_t uart_ring_buffer;
ring_buffer_t virtual_uart_ring_buffer;

static void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* Do MPU */
  HAL_MPU_Disable();

  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = (uint32_t)TX_Buffer;
  MPU_InitStruct.Size = MPU_REGION_SIZE_2KB;    
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  MPU_InitStruct.BaseAddress = (uint32_t)RX_Buffer;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  MPU_InitStruct.BaseAddress = (uint32_t)RX_Buffer_userspace;
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  MPU_InitStruct.BaseAddress = D3_SRAM_BASE;
  MPU_InitStruct.Size = MPU_REGION_SIZE_64KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER3;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Enable MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

static FLASH_OBProgramInitTypeDef OBInit;

