arduino/portentax8-stm32h7-fw/CM7/Core/Src/main.c
void disableCM4Autoboot() {
  OBInit.Banks     = FLASH_BANK_1;
  HAL_FLASHEx_OBGetConfig(&OBInit);
  dbg_printf("OBInit.USERConfig: %X\n", OBInit.USERConfig);
  if (OBInit.USERConfig & FLASH_OPTSR_BCM4) {
    dbg_printf("Changing option bytes\n");
    OBInit.OptionType = OPTIONBYTE_USER;
    OBInit.USERType = OB_USER_BCM4;
    OBInit.USERConfig = 0;
    if (HAL_FLASH_OB_Unlock() == HAL_OK)
      if (HAL_FLASH_Unlock() == HAL_OK)
        if (HAL_FLASHEx_OBProgram(&OBInit) == HAL_OK)
          if (HAL_FLASH_OB_Launch() == HAL_OK)
            if (HAL_FLASH_OB_Lock() == HAL_OK)
              if (HAL_FLASH_Lock() == HAL_OK)
              {
                dbg_printf("Option bytes changed\n");
                dbg_printf("Requires rebooting\n");
                NVIC_SystemReset();
                return;
              }
    dbg_printf("Failed changing option bytes");
  }
}


int main(void) {

  MPU_Config();

  SCB_EnableICache();
  SCB_EnableDCache();

  HAL_Init();

  SystemClock_Config();

  MX_USART2_UART_Init();

  PeriphCommonClock_Config();

  ring_buffer_init(&uart_ring_buffer);
  ring_buffer_init(&virtual_uart_ring_buffer);

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  //MX_FDCAN1_Init();
  //MX_FDCAN2_Init();
  MX_DMA_Init();
  MX_ADC3_Init();
  MX_HRTIM_Init();
  MX_RTC_Init();
  MX_SPI3_Init();

#ifdef PORTENTA_DEBUG_WIRED
  // Enable SPI2 (Portenta only)
  MX_SPI2_Init();
#endif

  HAL_ADC_Start(&hadc1);
  HAL_ADC_Start(&hadc2);
  HAL_ADC_Start(&hadc3);

  can_init_freq_direct(&fdcan_1, CAN_1, 800000);
  can_init_freq_direct(&fdcan_2, CAN_2, 800000);

  disableCM4Autoboot();

/*
  HAL_FDCAN_Start(&hfdcan1);
  HAL_FDCAN_Start(&hfdcan2);

  HAL_FDCAN_ActivateNotification(&hfdcan1, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0);
  HAL_FDCAN_ActivateNotification(&hfdcan2, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0);
*/

  memset((uint8_t*)TX_Buffer, 0, sizeof(TX_Buffer));
  memset((uint8_t*)RX_Buffer, 0, sizeof(RX_Buffer));

  struct complete_packet *tx_pkt = (struct complete_packet *)TX_Buffer;

  GPIO_InitTypeDef GPIO_InitStruct = {0};

  // IRQ PIN from H7 to M8
  // TODO: changeme when final HW is ready

  __HAL_RCC_GPIOA_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 1);

#ifndef PORTENTA_DEBUG_WIRED

  __HAL_RCC_GPIOA_CLK_ENABLE();

  // Interrupt on CS LOW
  GPIO_InitStruct.Pin = GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

#else

  // Enable LEDs (Portenta only)
  __HAL_RCC_GPIOK_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOK, &GPIO_InitStruct);

  // Interrupt on CS LOW
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);

  HAL_NVIC_SetPriority(EXTI0_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);
#endif

  // Start DMA on SPI
  //HAL_SPI_TransmitReceive_DMA(&hspi2, (uint8_t *)TX_Buffer,
  //                            (uint8_t *)RX_Buffer, sizeof(uint16_t) * 2);

  printf("Portenta X8 - STM32H7 companion fw - %s %s\n", __DATE__, __TIME__);

  int m4_app_valid = (((*(__IO uint32_t *) FLASH_BANK2_BASE) & 0xFF000000) == 0x10000000);

  if (m4_app_valid) {
    printf("Boot CM4\n");
    LL_RCC_ForceCM4Boot();
    int ret = serial_rpc_begin();
    printf("CM4 booted: %d\n", ret);
  }

  watchdog.Instance = IWDG1;
  watchdog.Init.Prescaler = IWDG_PRESCALER_16;
  watchdog.Init.Reload = (32000 * 2000) / (16 * 1000); /* 2000 ms */
  watchdog.Init.Window = (32000 * 2000) / (16 * 1000); /* 2000 ms */

  HAL_IWDG_Init(&watchdog);

#ifdef PORTENTA_DEBUG_WIRED
  HAL_GPIO_WritePin(GPIOK, GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7, 1);
#endif

  while (1) {

    __WFI();

    //serial_rpc_available();
    HAL_IWDG_Refresh(&watchdog);

    if (!ring_buffer_is_empty(&uart_ring_buffer)) {
        uint8_t temp_buf[1024];
        int cnt = ring_buffer_dequeue_arr(&uart_ring_buffer, temp_buf, ring_buffer_num_items(&uart_ring_buffer));
        enqueue_packet(PERIPH_UART, DATA, cnt, temp_buf);
    }

    if (!ring_buffer_is_empty(&virtual_uart_ring_buffer)) {
        uint8_t temp_buf[1024];
        int cnt = ring_buffer_dequeue_arr(&virtual_uart_ring_buffer, temp_buf, ring_buffer_num_items(&virtual_uart_ring_buffer));
        enqueue_packet(PERIPH_VIRTUAL_UART, DATA, cnt, temp_buf);
    }

    CAN_Message msg;
    if (can_read(&fdcan_1, &msg, 0)) {
      enqueue_packet(PERIPH_FDCAN1, DATA, sizeof(msg), &msg);
    }

    if (can_read(&fdcan_2, &msg, 0)) {
      enqueue_packet(PERIPH_FDCAN2, DATA, sizeof(msg), &msg);
    }

    if (transferState == TRANSFER_COMPLETE) {

#ifdef PORTENTA_DEBUG_WIRED
      HAL_GPIO_WritePin(GPIOK, GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7, 1);
#endif

      struct subpacket *rx_pkt_userspace =
          (struct subpacket *)RX_Buffer_userspace;

      while (rx_pkt_userspace->peripheral != 0xFF &&
             rx_pkt_userspace->peripheral != 0x00) {
        dbg_printf("Peripheral: %s Opcode: %X Size: %X\n  data: ",
        		to_peripheral_string(rx_pkt_userspace->peripheral), rx_pkt_userspace->opcode,
                rx_pkt_userspace->size);
        for (int i = 0; i < rx_pkt_userspace->size; i++) {
          dbg_printf("0x%02X ", *((&rx_pkt_userspace->raw_data) + i));
        }
        dbg_printf("\n");

        // do something useful with this packet
        dispatchPacket(rx_pkt_userspace->peripheral, rx_pkt_userspace->opcode,
        		rx_pkt_userspace->size, &(rx_pkt_userspace->raw_data));

        rx_pkt_userspace = (struct subpacket *)((uint8_t *)rx_pkt_userspace + 4 + rx_pkt_userspace->size);
      }
      transferState = TRANSFER_WAIT;
    }

    if (transferState == TRANSFER_ERROR) {
        dbg_printf("got transfer error, recovering\n");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 0);
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 1);
        transferState = TRANSFER_WAIT;
    }

